РемонтПК_Конфигурация/src/Documents/ЗакупкаЗапчастей/ЗакупкаЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаЗапчастей</name>
  <registerRecords>AccumulationRegister.ОстаткиЗапчастей</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказ</name>
    <attributes>
      <name>Запчасть</name>
      <type>
        <types>CatalogRef.ТоварыНаСкладе</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РемонтПК_Конфигурация/src/AccumulationRegisters/ОстаткиЗапчастей/ОстаткиЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЗапчастей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Запчасть</name>
    <type>
      <types>CatalogRef.ТоварыНаСкладе</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РемонтПК_Конфигурация/src/Documents/ЗакупкаЗапчастей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиЗапчастей.Записывать = Истина;
	
	Для Каждого Строка Из Заказ Цикл
		Движение = Движения.ОстаткиЗапчастей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Запчасть    = Строка.Запчасть;
		Движение.Количество  = Строка.Количество;
	КонецЦикла;
	
КонецПроцедуры
